<?php
/**
 *
 * @package 
 * @since 1.0
 * @todo 银行接口封装，主要封装第三方银行转账与批量转账
 */
 
class BankModel extends Model{

	/**
	 +------------------------------------------------------------------------------
	 * 充值
	 +------------------------------------------------------------------------------
	 * @param float		$mony		充值金额
	 * @param string	$ordernum	订单号
	 +------------------------------------------------------------------------------
	 * @return boolean	
	 +------------------------------------------------------------------------------
	 */
	public function Recharge($mony, $ordernum){
		//to do something
	echo $hello=$mony+$ordernum;
	}
	

	/**
	 +------------------------------------------------------------------------------
	 * 批量提现
	 +------------------------------------------------------------------------------
	 * @param arrat		$carnum		格式化的目标银行信息[卡号、开户行地址、账户名等]
	 * @param string	$ordernum	订单号
	 +------------------------------------------------------------------------------
	 * @return boolean	
	 +------------------------------------------------------------------------------
	 */
	public function Tocash($carnum, $ordernum){
		//to do something
	
	}
	
}